for_sale = ("Ошейник с колокольчиком", "Корм для попугаев", "Клетка для морских свинок", "Игрушка в виде кости", "Мяч")
print("Перечень товаров для животных : ", "1 -", for_sale[0], ",", "2 -", for_sale[1], ",", "3 -", for_sale[2], ",", "4 -", for_sale[3], ",", "5 -", for_sale[4], ".")

while True:
    a = input("Введите номер товара и нажмите Enter: ")
    if a == "1" or a == "2" or a == "3" or a == "4" or a == "5":
        print("Вы выбрали товар номер", a)
        break


    if a != "1" or a != "2" or a != 3 or a != 4 or a != 5:
        print("Выбранный товар недоступен")
        continue

