for_sale = ("Ошейник с колокольчиком", "Корм для попугаев", "Клетка для морских свинок", "Игрушка в виде кости", "Мяч")
print("Перечень товаров для животных : ", "1 -", for_sale[0], ",", "2 -", for_sale[1], ",", "3 -", for_sale[2], ",", "4 -", for_sale[3], ",", "5 -", for_sale[4], ".")
a = input("Введите номер товара и нажмите Enter: ")
if a == "1":
    print("Выбран товар - ", '"', for_sale[0], '"')
elif a == "2":
    print("Выбран товар - ", '"', for_sale[1], '"')
elif a == "3":
    print("Выбран товар - ", '"', for_sale[3], '"')
elif a == "4":
    print("Выбран товар - ", '"', for_sale[4], '"')
elif a == "5":
    print("Выбран товар - ", '"', for_sale[5], '"')
else:
    print("Неверный ввод")